// Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

Console.Clear();
Console.WriteLine("Введите число: ");
int num = int.Parse(Console.ReadLine());
if (num < 100 && num > -100) {
    Console.WriteLine("Третьей цифры нет");
}
else {
    
}



// Console.WriteLine("");
